Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Inc/py32e407_hal_i2c.h
/* Private macros ------------------------------------------------------------*/
/** @defgroup I2C_Private_Macros I2C Private Macros
  * @{
  */

#define I2C_MIN_PCLK_FREQ(__PCLK__, __SPEED__)                  (((__SPEED__) <= 100000U) ? ((__PCLK__) < I2C_MIN_PCLK_FREQ_STANDARD) : \
                                                                 (((__SPEED__) > 100000U) && ((__SPEED__) <= 400000U)) ? ((__PCLK__) < I2C_MIN_PCLK_FREQ_FAST) : \
                                                                 ((__PCLK__) < I2C_MIN_PCLK_FREQ_FAST_PLUS))

#define I2C_CCR_CALCULATION(__PCLK__, __SPEED__, __COEFF__)     (((((__PCLK__) - 1U)/((__SPEED__) * (__COEFF__))) + 1U) & I2C_CCR_CCR)

#define I2C_FREQRANGE(__PCLK__)                                 ((__PCLK__)/1000000U)

#define I2C_RISE_TIME(__FREQRANGE__, __SPEED__)                 (((__SPEED__) <= 100000U) ? ((__FREQRANGE__) + 1U) : \
                                                                 (((__SPEED__) > 100000U) && ((__SPEED__) <= 400000U)) ? ((((__FREQRANGE__) * 300U) / 1000U) + 1U) : \
                                                                 ((((__FREQRANGE__) * 300U) / 2500U) + 1U))

#define I2C_SPEED_STANDARD(__PCLK__, __SPEED__)                 ((I2C_CCR_CALCULATION((__PCLK__), (__SPEED__), 2U) < 4U)? 4U:I2C_CCR_CALCULATION((__PCLK__), (__SPEED__), 2U))

#define I2C_SPEED_FAST(__PCLK__, __SPEED__, __DUTYCYCLE__)      (((__DUTYCYCLE__) == I2C_DUTYCYCLE_2)? I2C_CCR_CALCULATION((__PCLK__), (__SPEED__), 3U) : (I2C_CCR_CALCULATION((__PCLK__), (__SPEED__), 25U) | I2C_DUTYCYCLE_16_9))

#define I2C_SPEED_FAST_PLUS(__PCLK__, __SPEED__, __DUTYCYCLE__) (((__DUTYCYCLE__) == I2C_DUTYCYCLE_2)? I2C_CCR_CALCULATION((__PCLK__), (__SPEED__), 8U) : (I2C_CCR_CALCULATION((__PCLK__), (__SPEED__), 5U) | I2C_DUTYCYCLE_16_9))

#define I2C_SPEED(__PCLK__, __SPEED__, __DUTYCYCLE__)           (((__SPEED__) <= 100000U)? (I2C_SPEED_STANDARD((__PCLK__), (__SPEED__))) : \
                                                                 (((__SPEED__) > 100000U) && ((__SPEED__) <= 400000U)) ? (((I2C_SPEED_FAST((__PCLK__), (__SPEED__), (__DUTYCYCLE__)) & I2C_CCR_CCR) == 0U)? 1U : \
                                                                 ((I2C_SPEED_FAST((__PCLK__), (__SPEED__), (__DUTYCYCLE__))) | I2C_CCR_FS)) : \
                                                                 ((I2C_SPEED_FAST_PLUS((__PCLK__), (__SPEED__), (__DUTYCYCLE__))) | I2C_CCR_FP))

#define I2C_DATA_HOLD_TIME(__FREQRANGE__, __SPEED__)            (((__SPEED__) <= 100000U) ? ((((__FREQRANGE__) * 300U) / 1000U) + 1U) : \
                                                                 (((__SPEED__) > 100000U) && ((__SPEED__) <= 400000U)) ? ((((__FREQRANGE__) * 300U) / 1000U) + 1U) : \
                                                                 ((((__FREQRANGE__) * 300U) / 2500U) + 1U))

#define I2C_7BIT_ADD_WRITE(__ADDRESS__)                         ((uint8_t)((__ADDRESS__) & (uint8_t)(~0x01)))

#define I2C_7BIT_ADD_READ(__ADDRESS__)                          ((uint8_t)((__ADDRESS__) | 0x01))
    
#define I2C_10BIT_ADDRESS(__ADDRESS__)                          ((uint8_t)((uint16_t)((__ADDRESS__) & (uint16_t)0x00FF)))

#define I2C_10BIT_HEADER_WRITE(__ADDRESS__)                     ((uint8_t)((uint16_t)((uint16_t)(((uint16_t)((__ADDRESS__) & (uint16_t)0x0300)) >> 7) | (uint16_t)0x00F0)))

#define I2C_10BIT_HEADER_READ(__ADDRESS__)                      ((uint8_t)((uint16_t)((uint16_t)(((uint16_t)((__ADDRESS__) & (uint16_t)0x0300)) >> 7) | (uint16_t)(0x00F1))))
    
#define I2C_MEM_ADD_MSB(__ADDRESS__)                            ((uint8_t)((uint16_t)(((uint16_t)((__ADDRESS__) & (uint16_t)0xFF00)) >> 8)))

#define I2C_MEM_ADD_LSB(__ADDRESS__)                            ((uint8_t)((uint16_t)((__ADDRESS__) & (uint16_t)0x00FF)))

/** @defgroup I2C_IS_RTC_Definitions I2C Private macros to check input parameters
  * @{
  */

#define IS_I2C_DUTY_CYCLE(CYCLE)                                (((CYCLE) == I2C_DUTYCYCLE_2) || \
                                                                 ((CYCLE) == I2C_DUTYCYCLE_16_9))

#define IS_I2C_DATA_TIME_HOLD_SEL(SEL)                          (((SEL) == I2C_DATA_HOLD_TIME_HARDWARE) || \
                                                                 ((SEL) == I2C_DATA_HOLD_TIME_SOFTWARE))

#define IS_I2C_ADDRESSING_MODE(ADDRESS)                         (((ADDRESS) == I2C_ADDRESSINGMODE_7BIT) || \
                                                                 ((ADDRESS) == I2C_ADDRESSINGMODE_10BIT))

#define IS_I2C_DUAL_ADDRESS(ADDRESS)                            (((ADDRESS) == I2C_DUALADDRESS_DISABLE) || \
                                                                 ((ADDRESS) == I2C_DUALADDRESS_ENABLE))

#define IS_I2C_OWN_ADDRESS2_MASK(MASK)                          (((MASK) == I2C_OA2_NOMASK) || \
                                                                 ((MASK) == I2C_OA2_MASK01) || \
                                                                 ((MASK) == I2C_OA2_MASK02) || \
                                                                 ((MASK) == I2C_OA2_MASK03) || \
                                                                 ((MASK) == I2C_OA2_MASK04) || \
                                                                 ((MASK) == I2C_OA2_MASK05) || \
                                                                 ((MASK) == I2C_OA2_MASK06) || \
                                                                 ((MASK) == I2C_OA2_MASK07))
#define IS_I2C_GENERAL_CALL(CALL)                               (((CALL) == I2C_GENERALCALL_DISABLE) || \
                                                                 ((CALL) == I2C_GENERALCALL_ENABLE))

#define IS_I2C_NO_STRETCH(STRETCH)                              (((STRETCH) == I2C_NOSTRETCH_DISABLE) || \
                                                                 ((STRETCH) == I2C_NOSTRETCH_ENABLE))

#define IS_I2C_MEMADD_SIZE(SIZE)                                (((SIZE) == I2C_MEMADD_SIZE_8BIT) || \
                                                                 ((SIZE) == I2C_MEMADD_SIZE_16BIT))

